# Taps
tap "bgreenwell/xleak"

# CLI nástroje
brew "eza"          # moderní ls
brew "gh"           # GitHub CLI
brew "glances"      # systémový monitor
brew "nmap"         # síťový scanner
brew "rclone"       # sync do cloudu
brew "tmux"         # terminálový multiplexer
brew "ykman"        # YubiKey manager (CLI)
brew "z3"           # SMT solver
brew "cloudflared"  # Cloudflare tunnel
brew "cointop"      # krypto terminal
brew "xleak"        # memory leak detector
brew "node"         # Node.js
brew "python@3.14"  # Python
brew "rust"         # Rust
brew "llvm"         # LLVM / Clang

# Aplikace (casks)
cask "alfred"           # launcher
cask "avast-security"   # antivirus
cask "balenaetcher"     # flashování obrazů na SD/USB
cask "brave-browser"    # prohlížeč
cask "claude"           # Claude AI
cask "github"           # GitHub Desktop
cask "google-drive"     # cloud storage
cask "mucommander"      # file manager
cask "qflipper"         # Flipper Zero
cask "spotify"          # hudba
cask "termius"          # SSH klient
cask "trezor-suite"     # Trezor hardware wallet
cask "veracrypt"        # šifrování disků
cask "visual-studio-code" # editor
cask "yubikey-manager"  # YubiKey Manager (GUI)
